app/Controllers/Ciudadanos.php

    public function index(): string
    {
        $ciudadanos = new CiudadanosModel();
        $datos['datos']=$ciudadanos->findAll();
---
SELECT *
FROM `ciudadanos`

    public function buscarCiudadano($id = null)
    {

        $ciudadanos = new CiudadanosModel();
        $datos['datos']=$ciudadanos->where('dpi',$id)->first();
---
SELECT *
FROM `ciudadanos`
WHERE `dpi` = '1007928191909'
 LIMIT 1