app/Controllers/Departamentos.php

SELECT *
FROM `departamentos`
---
    public function index(): string
    {
        $departamentos = new DepartamentosModel();
        $datos['datos']=$departamentos->findAll();

SELECT *
FROM `departamentos`
WHERE `cod_depto` = '1'
 LIMIT 1
---
    public function buscarDepartamento($id = null)
    {
        $departamentos = new DepartamentosModel();
        $datos['datos']=$departamentos->where('cod_depto',$id)->first();