app/Controllers/Regiones.php

SELECT *
FROM `regiones`
---
    public function index(): string
    {   //creando un objeto de tipo RegionesModel
        $regiones = new RegionesModel();
        $datos['datos']=$regiones->findAll();

SELECT *
FROM `regiones`
WHERE `cod_region` = '1'
 LIMIT 1
---
    public function buscarRegion($id = null)
    {
        $regiones = new RegionesModel();
        $datos['datos']=$regiones->where('cod_region',$id)->first();